---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod.ManuallyAdjusted
enum: Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod
source: html/28fcae11-78b7-c34b-d307-20055e71a26e.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod.ManuallyAdjusted

Reports if analytical model has been manually adjusted, this value can only set internally by Revit.